#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```
Acquiring state lock. This may take a few moments...
module.project_setup.google_firebase_project.default: Refreshing state... [id=projects/firebase-cloud-491613]
module.project_setup.google_project_service.apis["bigquerydatatransfer.googleapis.com"]: Refreshing state... [id=firebase-cloud-491613/bigquerydatatransfer.googleapis.com]
module.project_setup.google_project_service.apis["iam.googleapis.com"]: Refreshing state... [id=firebase-cloud-491613/iam.googleapis.com]
module.project_setup.google_project_service.apis["serviceusage.googleapis.com"]: Refreshing state... [id=firebase-cloud-491613/serviceusage.googleapis.com]
data.google_project.project: Reading...
module.project_setup.google_project_service.apis["firebasehosting.googleapis.com"]: Refreshing state... [id=firebase-cloud-491613/firebasehosting.googleapis.com]
module.project_setup.google_project_service.apis["compute.googleapis.com"]: Refreshing state... [id=firebase-cloud-491613/compute.googleapis.com]
module.project_setup.google_project_service.apis["firebase.googleapis.com"]: Refreshing state... [id=firebase-cloud-491613/firebase.googleapis.com]
module.project_setup.google_project_service.apis["firestore.googleapis.com"]: Refreshing state... [id=firebase-cloud-491613/firestore.googleapis.com]
module.project_setup.google_project_service.apis["artifactregistry.googleapis.com"]: Refreshing state... [id=firebase-cloud-491613/artifactregistry.googleapis.com]
module.project_setup.google_project_service.apis["run.googleapis.com"]: Refreshing state... [id=firebase-cloud-491613/run.googleapis.com]
data.google_project.project: Read complete after 0s [id=projects/firebase-cloud-491613]
module.project_setup.google_project_service.apis["secretmanager.googleapis.com"]: Refreshing state... [id=firebase-cloud-491613/secretmanager.googleapis.com]
module.project_setup.google_project_service.apis["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=firebase-cloud-491613/cloudresourcemanager.googleapis.com]
module.project_setup.google_project_service.apis["dns.googleapis.com"]: Refreshing state... [id=firebase-cloud-491613/dns.googleapis.com]
module.project_setup.google_project_service.apis["aiplatform.googleapis.com"]: Refreshing state... [id=firebase-cloud-491613/aiplatform.googleapis.com]
module.project_setup.google_project_service.apis["iamcredentials.googleapis.com"]: Refreshing state... [id=firebase-cloud-491613/iamcredentials.googleapis.com]
module.project_setup.google_project_service.apis["bigquery.googleapis.com"]: Refreshing state... [id=firebase-cloud-491613/bigquery.googleapis.com]
module.project_setup.google_project_service.apis["firebaserules.googleapis.com"]: Refreshing state... [id=firebase-cloud-491613/firebaserules.googleapis.com]
module.project_setup.google_project_service.apis["cloudbuild.googleapis.com"]: Refreshing state... [id=firebase-cloud-491613/cloudbuild.googleapis.com]
module.project_setup.google_project_service.apis["identitytoolkit.googleapis.com"]: Refreshing state... [id=firebase-cloud-491613/identitytoolkit.googleapis.com]
module.project_setup.google_identity_platform_config.auth: Refreshing state... [id=projects/firebase-cloud-491613/config]
module.apps.module.hooklab_identity.google_service_account.runtime: Refreshing state... [id=projects/firebase-cloud-491613/serviceAccounts/hooklab-runtime@firebase-cloud-491613.iam.gserviceaccount.com]
module.wif_pool.google_iam_workload_identity_pool.github: Refreshing state... [id=projects/firebase-cloud-491613/locations/global/workloadIdentityPools/github-actions-pool]
module.apps.module.hooklab_identity.google_service_account.ci_cd: Refreshing state... [id=projects/firebase-cloud-491613/serviceAccounts/hooklab-ci-cd@firebase-cloud-491613.iam.gserviceaccount.com]
module.artifact_registry.google_artifact_registry_repository.docker: Refreshing state... [id=projects/firebase-cloud-491613/locations/europe-west2/repositories/firebase-cloud]
module.apps.module.hooklab_firestore.google_firestore_database.app: Refreshing state... [id=projects/firebase-cloud-491613/databases/hooklab]
module.apps.module.hooklab_identity.google_project_iam_member.ci_cd_roles["roles/artifactregistry.writer"]: Refreshing state... [id=firebase-cloud-491613/roles/artifactregistry.writer/serviceAccount:hooklab-ci-cd@firebase-cloud-491613.iam.gserviceaccount.com]
module.apps.module.hooklab_identity.google_project_iam_member.ci_cd_roles["roles/run.admin"]: Refreshing state... [id=firebase-cloud-491613/roles/run.admin/serviceAccount:hooklab-ci-cd@firebase-cloud-491613.iam.gserviceaccount.com]
module.apps.module.hooklab_identity.google_project_iam_member.ci_cd_roles["roles/secretmanager.secretAccessor"]: Refreshing state... [id=firebase-cloud-491613/roles/secretmanager.secretAccessor/serviceAccount:hooklab-ci-cd@firebase-cloud-491613.iam.gserviceaccount.com]
module.apps.module.hooklab_identity.google_project_iam_member.ci_cd_roles["roles/iam.serviceAccountUser"]: Refreshing state... [id=firebase-cloud-491613/roles/iam.serviceAccountUser/serviceAccount:hooklab-ci-cd@firebase-cloud-491613.iam.gserviceaccount.com]
module.apps.module.hooklab_identity.google_project_iam_member.ci_cd_roles["roles/cloudbuild.builds.builder"]: Refreshing state... [id=firebase-cloud-491613/roles/cloudbuild.builds.builder/serviceAccount:hooklab-ci-cd@firebase-cloud-491613.iam.gserviceaccount.com]
module.apps.module.hooklab_identity.google_project_iam_member.ci_cd_roles["roles/firebase.admin"]: Refreshing state... [id=firebase-cloud-491613/roles/firebase.admin/serviceAccount:hooklab-ci-cd@firebase-cloud-491613.iam.gserviceaccount.com]
module.apps.module.hooklab_identity.google_project_iam_member.ci_cd_roles["roles/firebasehosting.admin"]: Refreshing state... [id=firebase-cloud-491613/roles/firebasehosting.admin/serviceAccount:hooklab-ci-cd@firebase-cloud-491613.iam.gserviceaccount.com]
module.apps.module.hooklab_identity.google_project_iam_member.runtime_roles["roles/monitoring.metricWriter"]: Refreshing state... [id=firebase-cloud-491613/roles/monitoring.metricWriter/serviceAccount:hooklab-runtime@firebase-cloud-491613.iam.gserviceaccount.com]
module.apps.module.hooklab_identity.google_project_iam_member.runtime_roles["roles/datastore.user"]: Refreshing state... [id=firebase-cloud-491613/roles/datastore.user/serviceAccount:hooklab-runtime@firebase-cloud-491613.iam.gserviceaccount.com]
module.apps.module.hooklab_identity.google_project_iam_member.runtime_roles["roles/logging.logWriter"]: Refreshing state... [id=firebase-cloud-491613/roles/logging.logWriter/serviceAccount:hooklab-runtime@firebase-cloud-491613.iam.gserviceaccount.com]
module.apps.module.hooklab_identity.google_project_iam_member.runtime_roles["roles/secretmanager.secretAccessor"]: Refreshing state... [id=firebase-cloud-491613/roles/secretmanager.secretAccessor/serviceAccount:hooklab-runtime@firebase-cloud-491613.iam.gserviceaccount.com]
module.apps.module.hooklab_identity.google_project_iam_member.runtime_roles["roles/cloudtrace.agent"]: Refreshing state... [id=firebase-cloud-491613/roles/cloudtrace.agent/serviceAccount:hooklab-runtime@firebase-cloud-491613.iam.gserviceaccount.com]
module.apps.module.hooklab_identity.google_iam_workload_identity_pool_provider.github: Refreshing state... [id=projects/firebase-cloud-491613/locations/global/workloadIdentityPools/github-actions-pool/providers/hooklab-github]
module.apps.module.hooklab_identity.google_service_account_iam_member.wif_binding: Refreshing state... [id=projects/firebase-cloud-491613/serviceAccounts/hooklab-ci-cd@firebase-cloud-491613.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/563789376070/locations/global/workloadIdentityPools/github-actions-pool/attribute.repository/poly-glot/webhook]
module.apps.module.hooklab_bigquery.google_project_iam_member.bq_data_viewer: Refreshing state... [id=firebase-cloud-491613/roles/bigquery.dataViewer/serviceAccount:hooklab-runtime@firebase-cloud-491613.iam.gserviceaccount.com]
module.apps.module.hooklab_bigquery.google_project_iam_member.bq_job_user: Refreshing state... [id=firebase-cloud-491613/roles/bigquery.jobUser/serviceAccount:hooklab-runtime@firebase-cloud-491613.iam.gserviceaccount.com]
module.apps.module.hooklab_bigquery.google_project_iam_member.vertex_user: Refreshing state... [id=firebase-cloud-491613/roles/aiplatform.user/serviceAccount:hooklab-runtime@firebase-cloud-491613.iam.gserviceaccount.com]
module.apps.module.hooklab_bigquery.google_bigquery_dataset.app: Refreshing state... [id=projects/firebase-cloud-491613/datasets/hooklab]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.project_setup.google_identity_platform_config.auth will be updated in-place
  ~ resource "google_identity_platform_config" "auth" {
        id                         = "projects/firebase-cloud-491613/config"
        name                       = "projects/563789376070/config"
        # (3 unchanged attributes hidden)

      - multi_tenant {
          - allow_tenants           = false -> null
            # (1 unchanged attribute hidden)
        }

      ~ sign_in {
            # (2 unchanged attributes hidden)

          - phone_number {
              - enabled            = false -> null
              - test_phone_numbers = {} -> null
            }

            # (2 unchanged blocks hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.apps.module.hooklab_cloud_run.google_cloud_run_v2_service.default will be created
  + resource "google_cloud_run_v2_service" "default" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = false
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "europe-west2"
      + name                    = "hooklab-api"
      + observed_generation     = (known after apply)
      + project                 = "firebase-cloud-491613"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + execution_environment            = "EXECUTION_ENVIRONMENT_GEN2"
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = "hooklab-runtime@firebase-cloud-491613.iam.gserviceaccount.com"
          + timeout                          = "300s"

          + containers {
              + build_info = (known after apply)
              + image      = "us-docker.pkg.dev/cloudrun/container/hello"

              + liveness_probe {
                  + failure_threshold     = 3
                  + initial_delay_seconds = 0
                  + period_seconds        = 30
                  + timeout_seconds       = 3

                  + http_get {
                      + path = "/api/health"
                      + port = (known after apply)
                    }
                }

              + ports (known after apply)

              + resources {
                  + cpu_idle          = true
                  + limits            = {
                      + "cpu"    = "1"
                      + "memory" = "512Mi"
                    }
                  + startup_cpu_boost = true
                }

              + startup_probe {
                  + failure_threshold     = 3
                  + initial_delay_seconds = 5
                  + period_seconds        = 10
                  + timeout_seconds       = 3

                  + http_get {
                      + path = "/api/health"
                      + port = (known after apply)
                    }
                }
            }

          + scaling {
              + max_instance_count = 10
              + min_instance_count = 0
            }
        }

      + traffic {
          + percent = 100
          + type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

  # module.apps.module.hooklab_cloud_run.google_cloud_run_v2_service_iam_member.public[0] will be created
  + resource "google_cloud_run_v2_service_iam_member" "public" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "europe-west2"
      + member   = "allUsers"
      + name     = "hooklab-api"
      + project  = "firebase-cloud-491613"
      + role     = "roles/run.invoker"
    }

  # module.apps.module.hooklab_hosting.google_firebase_hosting_site.default will be created
  + resource "google_firebase_hosting_site" "default" {
      + default_url = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = "firebase-cloud-491613"
      + site_id     = "hooklab"
      + type        = (known after apply)
    }

  # module.apps.module.hooklab_hosting.google_firebase_hosting_version.default will be created
  + resource "google_firebase_hosting_version" "default" {
      + id         = (known after apply)
      + name       = (known after apply)
      + site_id    = "hooklab"
      + version_id = (known after apply)

      + config {
          + headers {
              + glob    = "**"
              + headers = {
                  + "Permissions-Policy"     = "geolocation=(), microphone=(), camera=()"
                  + "Referrer-Policy"        = "strict-origin-when-cross-origin"
                  + "X-Content-Type-Options" = "nosniff"
                  + "X-Frame-Options"        = "DENY"
                  + "X-XSS-Protection"       = "1; mode=block"
                }
            }
          + headers {
              + glob    = "**/*.@(js|css|svg|png|jpg|jpeg|gif|ico|woff2)"
              + headers = {
                  + "Cache-Control" = "public, max-age=31536000, immutable"
                }
            }
          + rewrites {
              + glob = "**"
              + path = "/index.html"
            }
        }
    }

Plan: 4 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + hooklab_cloud_run_url = (known after apply)
  ~ hooklab_hosting_url   = "https://firebase-cloud-491613.web.app" -> "https://hooklab.web.app"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Triggered by @poly-glot, commit `d4f41b4684eaa0e8d55f8e721536cd3e8c51f6e7`*